Австралия/src/Documents/InventoryIncrease/InventoryIncrease.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryIncrease</name>
  <basedOn>Document.Stocktaking</basedOn>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccumulationRegister.InventoryCostLayer</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.InventoryInWarehouses</registerRecords>
  <registerRecords>AccumulationRegister.SerialNumbers</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>InformationRegister.SerialNumbersInWarranty</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Cell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.Stocktaking</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Correspondence</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <attributes>
    <name>RegisterIncome</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Precision</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SerialNumbers</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InventoryGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Ownership</name>
      <type>
        <types>CatalogRef.InventoryOwnership</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SerialNumbers</name>
    <attributes>
      <name>SerialNumber</name>
      <type>
        <types>CatalogRef.SerialNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/InventoryIncrease/Forms/PriceKindChoiceForm/Module.bsl
#Region Variables

&AtClient
Var PriceKindOnOpen;

#EndRegion

#Region ProcedureFormEventHandlers

// Procedure - event handler OnCreateAtServer of the form.
// The procedure implements
// - initializing the form parameters.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	PriceKind = Parameters.PriceKind;
	
	If Parameters.Property("Company") Then
		WorkWithForm.SetChoiceParametersByCompany(Parameters.Company, ThisForm, "PriceKind");	
	EndIf;
	
EndProcedure

// Procedure - OnOpen form event handler
// The procedure implements
// - initializing the form parameters.
//
&AtClient
Procedure OnOpen(Cancel)
	
	PriceKindOnOpen = PriceKind;
	
EndProcedure

#EndRegion

#Region ProcedureActionsOfTheFormCommandPanels

// Procedure - event handler of clicking the OK button.
//
&AtClient
Procedure CommandOK(Command)
	
	Cancel = False;
	If RefillPrices AND Not ValueIsFilled(PriceKind) Then
		Message = New UserMessage();
		Message.Text = NStr("en = 'Price type is required.'; ru = 'Требуется указать тип цен.';pl = 'Wymagany jest rodzaj ceny.';es_ES = 'Se requiere el tipo de precio.';es_CO = 'Se requiere el tipo de precio.';tr = 'Fiyat türü gerekli.';it = 'È richiesto il tipo di Prezzo.';de = 'Preistyp ist erforderlich.'");
		Message.Field = "PriceKind";
		Message.Message();
		Cancel = True;
	EndIf;
	
	If Not Cancel Then
		If PriceKindOnOpen <> PriceKind OR RefillPrices Then
			WereMadeChanges = True;
		Else
			WereMadeChanges = False;
		EndIf;
		StructureOfFormAttributes = New Structure;
		StructureOfFormAttributes.Insert("WereMadeChanges", WereMadeChanges);
		StructureOfFormAttributes.Insert("RefillPrices", RefillPrices);
		StructureOfFormAttributes.Insert("PriceKind", PriceKind);
		Close(StructureOfFormAttributes);
	EndIf;
	
EndProcedure

#EndRegion

#Region ProcedureEventHandlersOfFormAttributes

// Procedure - event handler OnChange of the PriceKind input field.
//
&AtClient
Procedure PriceKindOnChange(Item)
	
	If ValueIsFilled(PriceKind) Then
		If PriceKindOnOpen <> PriceKind Then
			RefillPrices = True;
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion
